[Information]
; (Latest Translator, First Translator, Second Translator ...)
TRANSLATOR=Teijo alias teijo@luukku.com
VERSION=6.7.0

[Language]
LANGUAGE=Suomi
CHARACTER_CODE=Unicode (UTF-16, LE, w/ BOM)
LOCALE_ID=0x040B,

[Url]
WIKIPEDIA_SMART=http://fi.wikipedia.org/wiki/Kiintolevy 
WIKIPEDIA_SMART2=http://ftfm.apz.fi/art/3/

[Menu]
FILE=&Tiedosto
CUSTOMIZE=&Mukauta
EXIT=&Lopeta
EDIT=&Muokkaa
COPY=&Kopioi
FUNCTION=To&iminto
HIDE_SMART_INFO=Piilota S.&M.A.R.T. -tiedot
HIDE_SERIAL_NUMBER=Piilota &sarjanumero
SHOW_DRIVE_LETTER=Näytä &asematunnus
ADVANCED_DISK_SEARCH=&Tarkennettu kiintolevyjen etsintä
EVENT_LOG=&Tapahtumaloki
AAM_APM_CONTROL=&Suorituskyvyn säätö (AAM/APM)
AUTO_AAM_APM_ADAPTION=Suorituskyvyn &automaattinen säätö (AAM/APM)
RESIDENT=Näytä &tehtäväpalkissa
STARTUP=Käynnistä &Windowsin käynnistyksen yhteydessä
OPEN_DISK_MANAGEMENT=Avaa Windowsin le&vynhallinta
OPEN_DEVICE_MANAGER=Avaa Windowsin laite&hallinta
ADVANCED_FEATURE=&Lisätoiminnot
REFRESH=&Päivitä
RESCAN=Etsi &uusia kiintolevyjä
DISABLE=&Ei käytössä
AUTO_REFRESH=&Automaattinen päivitys
AUTO_REFRESH_TARGET=P&äivityksen kohteet
AUTO_REFRESH_TARGET_ALL_DISK=&Valitse kaikki
AUTO_REFRESH_UNTARGET_ALL_DISK=&Poista valinnat
WAIT_TIME_AT_STARTUP=Kä&ynnistysviive
GRAPH=&Kuvaajat
THEME=T&eema
DISK=&Kiintolevy
HELP=&Ohje
HELP_WEB=&Ohje [Web]
HELP_ABOUT=&Tietoja ohjelmasta
HELP_ABOUT_SMART=Lisätietoja &S.M.A.R.T.:sta (Wikipedia) [Web]
LANGUAGE=&Kieli-
ITEM=&Aihe
TEMPERATURE_TYPE=&Lämpötilayksikkö
CELSIUS=&Celsius (°C)
FAHRENHEIT=&Fahrenheit (°F)
HEALTH_STATUS_SETTING=&Kunnonvalvonnan asetukset

;Graph
OPTION=&Asetukset
LEGEND_POSITION=&Selitteiden sijainti
NORTH_WEST=&Ylävasen
NORTH_EAST=Yläoikea
SOUTH_WEST=Alavasen
SOUTH_EAST=Alavasen
MAX_PLOT_POINT=&Maksimi piirtomäärä
TIME_FORMAT=&Ajan esitystapa
PAINT_WEEKEND=&Korosta viikonloput
ALL=&Kaikki

COPY_OPTION=Kopiointiasetukset
RESIDENT_STYLE=Tehtäväpalkista pienennettäessä
MINIMIZE=Pienennetään
HIDE=Piilotetaan
ZOOM=&Suurennus
AUTO=&Autom.
ATTRIBUTE=&Määrite
ASCII_VIEW=Tekstinäkymä
AUTO_DTECTION=A&utomaattitunnistus
SECOND=sek.
MINUTE=min.
HOUR=tuntia
WORKAROUND=&Virheenkorjaustila
ALERT_MAIL=&Hälytysviesti
MAIL_SETTINGS=&Viestiasetukset
SMART_IN_ENGLISH=S.M.A.R.T. -tiedot englanniksi
FONT_SETTING=Fontti
ALERT_FEATURES=&Hälytystoiminnot
ALARM_HISTORY=Hälytyshistoria
ALERT_SOUND=Hälytysääni
SOUND_SETTINGS=Ääniasetukset
GADGET_SUPPORT=Pienoisohjelmatuki
INSTALL_GADGET=Asenna pienoisohjelma
ENABLE_AUTO=Käytössä (Automaattinen)
ENABLE_ALL=Käytössä (Kaikki levyt)
ENABLE_RAID=Käytössä (Vain RAID-levyt)

;6.0.0
HIDE_NO_SMART_DISK=&Piilota muut kuin S.M.A.R.T. kiintolevyt
GREEN_MODE=&Vihreä tila

[TrayMenu]
EXIT=Lopeta
REFRESH=Päivitä
RESCAN=Etsi uusia kiintolevyjä
ENABLE=Käytössä
DISABLE=Ei käytössä
ENABLE_ALL=Kaikki kiintolevyt
DISABLE_ALL=Ei yhtään kiintolevyä
AUTO_REFRESH=Automaattinen päivitys
AUTO_REFRESH_01_MIN=1 min.
AUTO_REFRESH_03_MIN=3 min.
AUTO_REFRESH_05_MIN=5 min.
AUTO_REFRESH_10_MIN=10 min.
AUTO_REFRESH_30_MIN=30 min.
AUTO_REFRESH_60_MIN=60 min.
AUTO_REFRESH_TARGET=Päivitä tilatietoja
AUTO_REFRESH_TARGET_ALL_DISK=Päivitä kaikkien tilatietoja
AUTO_REFRESH_UNTARGET_ALL_DISK=Älä päivitä yhdenkään tilatietoja
ALARM_SETTING_TEMPERATURE=Lämpötilavalvonta
ALARM_SETTING_HEALTH_STATUS=Kunnon valvonta
SHOW_MAIN_WINDOW=Avaa suurennettuna
SHOW_TEMPERATURE_ICON=Näytä lämpötila
SHOW_ALL_TEMPERATURE_ICON=Näytä kaikkien lämpötilat
HIDE_ALL_TEMPERATURE_ICON=Piilota kaikkien lämpötilat
COLLECTIVE_SETTING=Ryhmäasetukset
GRAPH=Kuvaajat
SHOW_TEMPERATURE_ICON_ONLY=Näytä vain lämpötilakuvake

[DiskStatus]
GOOD=Hyvä
CAUTION=Varoitus
BAD=Huono
UNKNOWN=Tuntematon
DISK=Levy

[Dialog]
LIST_ID=ID
LIST_CURRENT=Nykyinen
LIST_WORST=Huonoin
LIST_THRESHOLD=Kynnys
LIST_RAW_VALUES=Luettu tieto
;LIST_DESCRIPTION=Kuvaus
LIST_ATTRIBUTE_NAME=Määrite

FIRMWARE=Laitteistoversio:
SERIAL_NUMBER=Sarjanumero:
INTERFACE=Liityntä:
STANDARD=Standardi:
TRANSFER_MODE=Siirtomoodi:
BUFFER_SIZE=Puskuri:
NV_CACHE_SIZE=NV välimuisti:
ROTATION_RATE=Pyöritysnopeus:
TEMPERATURE=Lämpötila:
POWER_ON_HOURS=Käyttöaika:
POWER_ON_COUNT=Käynnistyksiä:
DRIVE_LETTER=Asematunnukset:
FEATURE=Tuetut ominaisuudet:
HEALTH_STATUS=Kunto:

UNKNOWN=Tuntematon
POWER_ON_COUNT_UNIT=kertaa
POWER_ON_HOURS_UNIT=tuntia
POWER_ON_DAYS_UNIT=vrk

TOTAL_HOST_WRITES=Isäntäkirjoituskertoja
TOTAL_HOST_READS=Isäntälukukertoja
TOTAL_NAND_WRITES=NAND kirjoituskertoja

WEAR_LEVELING_COUNT=Kuluneisuusaste

CURRENT_MODE_SUPPORTED_MODE=Nykyinen tila | Tuettu tila
MAJOR_VERSION_MINOR_VERSION=Pääversio | Aliversio

[Message]
DETECT_UNIT_POWER_ON_HOURS=Käyttöaikatietoja noudetaan (kestää noin 2 min.)
DETECT_DISK=Tunnistetaan kiintolevyä
PLEASE_ENABLE_WMI=Käynnistä Windows Management Instrumentation (WMI)
PLEASE_RESTART_THIS_APPLICATION=Käynnistä ohjelma uudestaan jotta tehdyt muutokset astuvat voimaan
DISK_NOT_FOUND=Kiintolevyä ei löydy

[Alarm]
ALARM_TEMPERATURE=Lämpötilahälytys
ALARM_HEALTH_STATUS=Kuntohälytys
DEGRADATION=Heikentyminen
RECOVERY=Korjautuminen
INFO_HEALTH_STATUS=Kuntotietoja

[Graph]
PLEASE_SELECT_ITEM=Valitse kohde
ACTUAL_VALUE=Luettu tieto
NORMALIZED_VALUE=Arvo
ALL_ON=Näytä kaikki
ALL_OFF=Piilota kaikki
RESET=Tyhjennä

[Customize]
LINE_COLOR=Viivat
BACKGROUND_IMAGE=Taustakuvio
SUPPORTED_IMAGE_FORMAT=Kaikki tuetut 
ALL_FILES=Kaikki tiedostot
SUPPORTED_SOUND_FORMAT=Tuetut äänimuodot

[AamApm]
AAM_LOW=<- Hiljainen (80h)
AAM_HIGH=Hyvä suorituskyky (FEh) ->
AAM_RECOMMEND=Suositusarvo
APM_LOW=<- Pieni tehonkulutus (01h)
APM_HIGH=Hyvä suorituskyky (FEh) ->
AUTOMATIC_ACOUSTIC_MANAGEMENT=Äänitason hallinta (AAM)
ADVANCED_POWER_MANAGEMENT=Automaattinen virranhallinta (APM)

[WindowTitle]
ABOUT=Tietoja ohjelmasta
GRAPH=Kuvaajat
CUSTOMIZE=Mukauta
VERSION_INFORMATION=Versiotietoja
AAM_APM_CONTROL=AAM/APM -säädöt
HEALTH_STATUS_SETTING=Kunnonvalvonnan asetukset
ALARM_HISTORY=Hälytyshistoria
SOUND_SETTINGS=Hälytysääni
FONT_SETTING=Fontti

[HealthStatus]
THRESHOLD_OF_CAUTION=Hälytysraja
APPLY=Käytä
DEFAULT=Oletus

[Smart]
UNKNOWN=Tuntematon
VENDOR_SPECIFIC=Valmistajakohtainen
01=Lukuvirhetiheys
02=Läpimenon suorityskyky
03=Käynnistymisaika
04=Käynnistys/pysäytyskertoja
05=Uudelleensijoitettuja sektoreita
06=Lukukanavan marginaali
07=Hakuvirhetiheys
08=Hakujen suorituskyky
09=Käyttöaika
0A=Pyörityksen uudelleenyritykset
0B=Uudelleenkalibrointiyritykset
0C=Jännitteenkytkentäkertoja
0D=Korjaamattomien lukuvirheiden tiheys
B8=Päästä-päähän virheitä
BB=Korjauskelvottomia virheitä
BC=Myöhästyneitä komentoja
BD=Kirjoituskertoja suurella etäisyydellä
BE=Ympäristön lämpötila
BF=Kiihtyvyysvirhetiheys
C0=Sammutuksen peruutuksia
C1=Hakupään liikkeellelähtöjä
C2=Lämpötila
C3=Laitteistotasolla korjattuja pariteettivirheitä
C4=Sektoreiden uudelleensijoituskertoja
C5=Uudelleensijoitusta odottavia sektoreita
C6=Korjauskelvottomia sektoreita
C7=UDMA-tarkistusvirheitä
C8=Kirjoitusvirhetiheys
C9=Ohjelmistolukuvirheiden tiheys
CA=Osoitteen merkkivirhe
CB=Loppumisten peruutuskertoja
CC=Ohjelmistokorjattuja pariteettivirheitä
CD=Lämpötilojen ankaruus
CE=Lentokorkeus
CF=Suurivirtaisia pyörityksiä
D0=Pyörityssurina
D1=Taustahakujen suorituskyky
D3=Tärinää kirjoitettaessa
D4=Iskuja kirjoitettaessa
DC=Levysiirtymä
DD=Kiihtyvyysvirhetiheys
DE=Lukupään käyttöaika
DF=Lukupään muutoksia
E0=Mekaaninen liikevastus
E1=Lukupään käyttökertoja
E2=Liikkeelläoloaika
E3=Nopeusvirheiden korjauksia
E4=Sammutuksen peruutuksia
E6=GMR-Lukupään amplitudi
E7=Lämpötila
F0=Lukupään lentoaika
FA=Lukuvirheiden korjaustiheys
FE=Vapaan pudotuksen suojauksia
F1=LBA kirjoituskertoja
F2=LBA lukukertoja

[SmartSsd]
01=Lukuvirhetiheys
02=Läpimenon suorityskyky
03=Käynnistymisaika
04=Käynnistys/pysäytyskertoja
05=Uudelleensijoitettuja sektoreita
06=Lukukanavan marginaali
07=Hakuvirhetiheys
08=Hakujen suorituskyky
09=Käyttöaika
0A=Pyörityksen uudelleenyritykset
0B=Uudelleenkalibrointiyritykset
0C=Jännitteenkytkentäkertoja
0D=Korjaamattomien lukuvirheiden tiheys
C0=Vaarallisia sammutuksia
C2=Lämpötila
C4=Sektoreiden uudelleensijoituskertoja
C5=Uudelleensijoitusta odottavia sektoreita
C6=Korjauskelvottomia sektoreita
; CrystalDiskInfo assign
FF=Jäljellä oleva elinaika
F1=Laiteisännän kirjoituskertoja
F2=Laiteisännän lukukertoja

[SmartMtron]
BB=Täydellisiä tyhjennyskertoja

[SmartIndlinx]
01=Lukuvirhetiheys
09=Käyttöaika
0C=Jännitteenkytkentäkertoja
B8=Alkuperäinen viallisten lohkojen määrä
C3=Ohjelmointivirheellisten lohkojen määrä
C4=Tyhjennysvirheellisten lohkojen määrä
C5=Lukuvirheellisten lohkojen määrä
C6=Sektoreiden lukukertoja
C7=Sektoreiden kirjoituskertoja
C8=Lukukomentojen kokonaismäärä
C9=Kirjoituskomentojen kokonaismäärä
CA=Flash-muistin virheellisten tavujen kokonaismäärä
CB=Korjaavalla bitillä varustettujen lukusektoreiden kokonaismäärä
CC=Virheellinen lohko täynnä -lippu
CD=Tyhjennyskertojen enimmäismäärän seuranta
CE=Tyhjennyskertoja vähintään
CF=Tyhjennyskertoja enintään
D0=Tyhjennyskertoja keskimäärin
D1=Jäljellä oleva elinaika

[SmartJMicron60x]
09=Käyttöaika
0C=Jännitteenkytkentäkertoja
C2=Lämpötila
E5=Järjestelmän pysäytystunnus / Flash ID
E8=Laitteistoversiotietoja (Firmware)
E9=ECC-virhetietue
EA=Keskimääräisten tyhjennyskertojen suhde enimmäisarvoon
EB=Kunnollisten lohkojen osuus

[SmartIntel]
03=Käynnistymisaika
04=Käynnistys/pysäytyskertoja
05=Uudelleensijoitettuja lohkoja
09=Käyttöaika
0C=Jännitteenkytkentäkertoja
C0=Vaarallisia sammutuksia
E1=Isäntäkirjoituksia
E8=Käytettävissäolevaa varattua tilaa
E9=Kuluneisuusilmaisin
B8=Päästä-päähän virheitä
AA=Käytettävissäoleva varattu tila
AB=Kirjoitusvirheitä
AC=Tyhjennysvirheitä
BB=Korjauskelvottomia virheitä
AE=Odottamattomia jännitekatkoja
E2=Ajastettu kuorman kuluneisuus
E3=Ajastettu kuorman luku/kirjoitussuhde
E4=Ajastettu kuormanajastus
F1=LBA kirjoituskertoja
F2=LBA lukukertoja
F9=NAND kirjoituskertoja
B7=SATA-liitännän nopeudenvaihtoja
BE=Lämpötila
C7=Tarkistussummavirheitä
AF=Jännittenkatkaisun suojaamisvirheitä
C2=Lämpötila
C5=Odottavia sektoreita

;Added 6.6.0
EA=Thermal Throttle Status

[SmartSamsung] 
05=Uudelleensijoitettuja sektoreita
09=Käyttöaika
0C=Jännitteenkytkentäkertoja
AF=Epäonnistuneita ohjelmointikertoja (Piiri)
B0=Epäonnistuneita tyhjennyskertoja (Piiri)
B1=Kuluneisuusaste
B2=Varattuja lohkoja käytetty (Piiri)
B3=Varattuja lohkoja käytetty 
B4=Käyttämättömiä varattuja lohkoja 
B5=Epäonnistuneita ohjelmointikertoja 
B6=Epäonnistuneita tyhjennyskertoja 
B7=Ajonaikaisia virheellisiä lohkoja 
BB=Korjauskelvottomia virheitä
BE=Ympäristön lämpötila
C2=Lämpötila
C3=ECC-virhesuhde
C6=Korjauskelvottomia virheitä
C7=Tarkistussummavirheitä
C9=Varmennuspariston tila (SuperCap)
CA=SSD-tilailmaisin
EB=POR palautumiskertoja
F1=LBA kirjoituskertoja
F2=LBA lukukertoja
;Added 6.6
AA=Varalla olevia lohkoja
AB=Epäonnistuneita ohjelmointikertoja
AC=Epäonnistuneita tyhjennyskertoja
AD=Kuluneisuusaste
AE=Odottamattomia jännitekatkoja
B8=Virheentunnistus
E9=Normalisoitu kuluneisuusaste

[SmartSandForce]
01=Raaka lukuvirhetiheys
05=Käytöstäpoistettuja lohkoja
09=Käyttöaika
0C=Jännitteenkytkentäkertoja
0D=Ohjelmistolukuvirheiden tiheys
64=Tyhjennettyjä Gigatavuja
AA=Varattuja lohkoja
AB=Epäonnistuneita ohjelmointikertoja
AC=Epäonnistuneita tyhjennyskertoja
AE=Odottamattomia virtakatkoja
B1=Kuluneisuusaste
B5=Epäonnistuneita ohjelmointikertoja
B6=Epäonnistuneita tyhjennyskertoja
B8=Reportoidut I/O-virhekoodivirheet
BB=Korjauskelvottomia virheitä
C2=Lämpötila
C3=Lennossa korjauskelvottomia virheitä
C4=Sektoreiden uudelleensijoituskertoja
C6=Korjauskelvottomia sektoreita
C7=SATA Tarkistussummavirheitä
C9=Ohjelmistollisesti korjauskelvottomien lukuvirheiden tiheys
CC=Ohjelmistokorjattujen pariteettivirheiden tiheys
E6=Elinkaaren tila
E7=Jäljelläoleva elinaika
E8=Käytettävissäoleva varattu tila
EB=Varmennuspariston tila (SuperCap)
F1=Elinaika (Kirjoituskertoja)
F2=Elinaika (Lukukertoja)

[SmartJMicron61x]
01=Lukuvirhetiheys
02=Läpikulun suorityskyky
03=Käynnistymisaika
05=Uudelleensijoitettuja sektoreita
07=Hakuvirhetiheys
08=Hakujen suorituskyky
09=Käyttöaika
0A=Pyörityksen uudelleenyritykset
0C=Jännitteenkytkentäkertoja
A8=SATA PHY virheitä
AF=Virheellisiä klusteritaulukoita (ECC-virheitä)
C0=Vaarallisia sammutuksia
C2=Lämpötila
C5=Odottavia sektoreita
AA=Virheellisiä lohkoja
AD=Tyhjennyskertoja

[SmartMicron]
01=Raaka lukuvirhetiheys
05=Uudelleensijoitettuja sektoreita
09=Käyttöaika
0C=Jännitteenkytkentäkertoja
AB=Epäonnistuneita ohjelmointikertoja
AC=Epäonnistuneita tyhjennyskertoja
AE=Odottamattomia jännitekatkoja
B7=SATA-liitännän nopeudenvaihtoja
B8=Virheiden korjauksia
BB=Korjauskelvottomia virheitä
BD=Valmistusvirheellisiä lohkoja
C2=Kotelon lämpötila
C3=Korjattuja pariteettivirheitä
C4=Sektoreiden uudelleensijoituskertoja
C5=Odottavia sektoreita
C6=Korjauskelvottomia sektoreita
C7=UDMA tarkistussummavirhesuhde
CE=Kirjoitusvirhesuhde
0D=Ohjelmistolukuvirheiden tiheys
AA=Varattuja lohkoja
AD=Lohkojen tyhjennyskertoja keskimäärin
B5=Ohjelmistollisia sivunkohdistuksia
BC=Myöhästyneitä komentoja
CA=Suhteellinen elinaika
CE=Write Error Rate
D2=Successful RAIN Recovery Count
EA=Total Bytes Read
F2=Write Protect Progress
F3=ECC Bits Corrected
F4=ECC Cumulative Threshold Events
F5=Cumulative Program NAND Pages
F6=Total Host Sector Writes
F7=Host Program Page Count
F8=Background Program Page Count

[SmartMicronMU02] ;Updated 6.6.0
; RAIN = Redundant Array of Independent NAND
01=Raw Read Error Rate
05=Reallocated Sectors Count
09=Power-On Hours
0C=Power Cycle Count
0D=Soft Error Rate
0E=Device Capacity (NAND)
0F=User Capacity
10=Spare Blocks Available
11=Remaining Spare Blocks
64=Total Erase Count
AA=Reserved Block Count
AB=Program Fail Count
AC=Erase Fail Count
AD=Average Block-Erase Count
AE=Unexpected Power Loss Count
B4=Unused Reserve NAND Blocks
B7=SATA Interface Downshift
B8=Error Correction Count
BB=Reported Uncorrectable Errors
BC=Command Timeout Count
BD=Factory Bad Block Count
C2=Temperature
C3=Cumulative ECC Bit Correction Count
C4=Reallocation Event Count
C5=Current Pending Sector Count
C6=Smart Off-line Scan Uncorrectable Error Count
C7=Ultra DMA CRC Error Rate
CA=Percent Lifetime Used
CE=Write Error Rate
D2=Successful RAIN Recovery Count
EA=Total Bytes Read
F3=ECC Bits Corrected
F4=ECC Cumulative Threshold Events
F5=Cumulative Program NAND Pages
F6=Total Host Sector Writes
F7=Host Program Page Count
F8=Background Program Page Count

; Updated 6.6.0
A0=Uncorrectable Sector Count
A1=Valid Spare Blocks
A3=Initial Invalid Blocks
94=Total SLC Erase Count
95=Maximum SLC Erase Count
96=Minimum SLC Erase Count
97=Average SLC Erase Count
A4=Total TLC Erase Count
A5=Maximum TLC Erase Count
A6=Minimum TLC Erase Count
A7=Average TLC Erase Count
A9=Percentage Lifetime Remaining
B5=Program Fail Count
B6=Erase Fail Count
C0=Power-off Retract Count
E8=Available Reserved Space
F1=Total LBA Write
F2=Total LBA Read
F5=Total TLC Write Count
F6=Total SLC Write Count
F7=RAID Recovery Count

[SmartMicron] 
; RAIN = Redundant Array of Independent NAND
01=Raaka lukuvirhetiheys
05=Uudelleensijoitettuja sektoreita
09=Käyttöaika
0C=Jännitteenkytkentäkertoja
AB=Epäonnistuneita ohjelmointikertoja
AC=Epäonnistuneita tyhjennyskertoja
AE=Odottamattomia jännitekatkoja
B7=SATA-liitännän nopeudenvaihtoja
B8=Virheiden korjauksia
BB=Korjauskelvottomia virheitä
BD=Valmistusvirheellisiä lohkoja
C2=Kotelon lämpötila
C3=Korjattuja pariteettivirheitä
C4=Sektoreiden uudelleensijoituskertoja
C5=Odottavia sektoreita
C6=Korjauskelvottomia virheitä
C7=UDMA-tarkistussummavirhesuhde
CE=Kirjoitusvirhesuhde
0D=Ohjelmistolukuvirheiden tiheys
AA=Varattuja lohkoja
AD=Lohkojen tyhjennyskertoja keskimäärin
BC=Myöhästyneitä komentoja
CA=Suhteellinen elinaika
0E=Laitekapasiteetti (NAND)
0F=Käytetettävissä
10=Varalohkoja käytettävissä
11=Käyttämättömiä varalohkoja 
64=Tyhjennyskertoja
B4=Käyttämättömiä varattuja lohkoja
B5=Virheellisiä käyttöyrityksiä
D2=Onnistuneita RAIN-korjauksia
EA=Luettuja tavuja kaikkiaan
F2=Kirjoitussuojauksen edistyminen
F3=ECC-bitteja korjattu
F4=ECC-kynnystapahtumia yhteensä
F5=NAND-ohjelmointisivuja yhteensä
F6=Sektoreiden isäntäkirjoituskertoja
F7=Isäntäohjelman sivuja
F8=FTL-ohjelmasivuja

[SmartOcz]
01=Raaka lukuvirhetiheys
03=Käynnistymisaika
04=Käynnistys/pysäytyskertoja
05=Uudelleensijoitettuja sektoreita
09=Käyttöaika
0C=Jännitteenkytkentäkertoja
E8=Käytettävissäolevia kirjoitussektoreita
E9=Elinaika

; Added 6.6.0
64=Total Blocks Erased
A7=SSD Protect Mode
A8=SATA PHY Error Count
A9=Bad Block Count
AD=Erase Count
B8=Factory Bad Block Count
C0=Unexpected Power Loss Count
CA=Total Number of Corrected Bits
CD=Max Rated PE Counts
CE=Minimum Erase Counts
CF=Maximum Erase Counts
D3=SATA Uncorrectable Error Count
D4=NAND Page Reads During Retry
D5=Simple Read Retry Attempts
D6=Adaptive Read Retry Attempts
DD=Internal Data Path Uncorrectable Errors
DE=RAID Recovery Count
E6=Power Loss Protection
FB=NAND Read Count

;Updated 6.7.0
F1=Total Host Writes
F2=Total Host Reads

[SmartPlextor]
01=Lukuvirhetiheys
05=Uudelleensijoitettuja sektoreita
09=Käyttöaika
0C=Jännitteenkytkentäkertoja
C0=Vaarallisia sammutuksia
C4=Sektoreiden uudelleensijoituskertoja
C6=Korjauskelvottomia virheitä
F1=Laiteisännän kirjoituskertoja
F2=Laiteisännän lukukertoja
B1=Kuluneisuusaste
B2=Varattuja lohkoja käytetty
B5=Epäonnistuneita ohjelmointikertoja 
B6=Epäonnistuneita tyhjennyskertoja
BB=Korjauskelvottomia virheitä
C7=Tarkistussummavirheitä
E8=Käytettävissäoleva varattu tila

;Added 6.2.0
AA=Lisääntyneitä virheellisiä lohkoja
AB=Epäonnistuneita ohjelmointikertoja
AC=Epäonnistuneita tyhjennyskertoja
AD=Lohkojen tyhjennyskertoja keskimäärin
AE=Odottamattomia virtakatkoja
AF=Epäonnistuneita ohjelmointikertoja (Pahin tapaus)
B0=Epäonnistuneita tyhjennyskertoja (Pahin tapaus)
B3=Varattuja lohkoja käytetty
B4=Käyttämättömiä varattuja lohkoja 
B7=SATA-liitännän nopeudenvaihtoja
B8=Korjattuja päästä-päähän -virheitä
BC=Myöhästyneitä komentoja
C3=ECC-suhde
E9=NAND kirjoitettu tietomäärä (Gt)

[SmartSanDisk]
05=Käytöstäpoistettuja lohkoja
09=Käyttöaika
0C=Jännitteenkytkentäkertoja
AA=Varalla olevia lohkoja
AB=Epäonnistuneita ohjelmointikertoja
AC=Epäonnistuneita tyhjennyskertoja
AE=Odottamattomia jännitekatkoja
BB=Korjauskelvottomia virheitä
E8=Jäljelläoleva elinaika
F1=Laiteisännän kirjoituskertoja
F2=Laiteisännän lukukertoja

[SmartOczVector]
05=Suorituksenaikaisia virheellisiä lohkoja
09=Käyttöaika
0C=Jännitteenkytkentäkertoja
AB=Käytettävissäolevia ylimääräsiä lohkoja
AE=Odottamattomia jännitekatkoja
BB=Korjauskelvottomia NAND-lukukertoja
C3=Epäonnistuneita ohjelmointikertoja
C4=Epäonnistuneita tyhjennyskertoja
C5=Epäonnistuneita lukukertoja
C6=Laiteisännän lukukertoja
C7=Laiteisännän kirjoituskertoja
D0=Tyhjennyskertoja keskimäärin
D2=SATA Tarkistussummavirheitä
E9=Jäljelläoleva elinaika
F9=Ohjelmointikertoja
F1=Laiteisännän kirjoituskertoja
F2=Laiteisännän lukukertoja

;Updated 6.6.0
64=Total Blocks Erased
B8=Factory Bad Block Count Total
CA=Total Number Of Read Bits Corrected
CD=Max Rated PE Count
CE=Min Erase Count
CF=Max Erase Count
D4=Total Count NAND Pages Reads Requiring Read Retry
D5=Total Count of Simple Read Retry Attempts
D6=Total Count of Adaptive Read Retry Attempts
DD=Internal Data Path Protection Uncorrectable Errors
DE=RAID Recovery Count
E0=In Warranty
E1=DAS Polarity
E2=Partial Pfail
E6=Write Throttling Activation Flag
F9=Total NAND Programming Count (pages)
FB=Total NAND Read Count

[SmartCorsair]
01=Raaka lukuvirhetiheys
05=Käytöstäpoistettuja sektoreita
09=Käyttöaika
0C=Jännitteenkytkentäkertoja
AA=Varalla olevia lohkoja
AC=Epäonnistuneita tyhjennyskertoja
AE=Odottamattomia jännitekatkoja
B5=Epäonnistuneita ohjelmointikertoja 
BB=Korjauskelvottomia virheitä
C2=Lämpötila
C4=Sektoreiden uudelleensijoituskertoja
E7=Jäljelläoleva elinaika
F1=Elinaika (Kirjoituskertoja)
F2=Elinaika (Lukukertoja)

[SmartToshiba]
01=Raaka lukuvirhetiheys
02=Läpikulun suorityskyky
03=Käynnistymisaika
04=Käynnistys/pysäytyskertoja
05=Uudelleensijoitettuja sektoreita
07=Hakuvirhetiheys
08=Hakujen suorituskyky
09=Käyttöaika
0A=Pyörityksen uudelleenyritykset
0B=Uudelleenkalibrointiyritykset
0C=Jännitteenkytkentäkertoja
A7=SSD-suojaustila
A8=SATA PHY-virheitä
A9=Virheellisiä lohkoja
AD=Tyhjennyskertoja
C0=Odottamattomia jännitekatkoja
C2=Lämpötila
C4=Sektoreiden uudelleensijoituskertoja
C5=Odottavia sektoreita
C6=Korjauskelvottomia sektoreita
F1=Laiteisännän kirjoituskertoja
F2=Laiteisännän lukukertoja

[SmartSanDiskGb] 
05=Uudelleensijoitettuja sektoreita
09=Käyttöaika
0C=Jännitteenkytkentäkertoja
A6=Kirjoitus/tyhjennyskertoja vähintään
A7=Virheellistejen lohkojen enimmäismäärä
A8=Tyhjennyskertoja enintään
A9=Virheellisiä lohkoja
AB=Epäonnistuneita ohjelmointikertoja
AC=Epäonnistuneita tyhjennyskertoja
AD=Tyhjennyskertoja keskimäärin
AE=Odottamattomia jännitekatkoja
BB=Korjauskelvottomia virheitä
C2=Lämpötila
D4=SATA PHY-virheitä
E6=Ohjelmointi/tyhjennyssuhde
E8=Käytettävissäoleva varattu tila
E9=NAND kirjoitettu tietomäärä (Gt)
F1=Kirjoitettu tietomäärä (Gt)
F2=Luettu tietomäärä (Gt)

[SmartKingston] ;Added 6.6.0
01=Read Error Rate
02=Throughput Performance
03=Spin Up Time
05=Reallocated Sectors Count
07=Seek Error Rate
08=Seek Time Performance
09=Power-On Hours
0A=Spin Retry Count
0C=Power Cycle Count
A8=SATA PHY Error Count
AA=Bad Block Count
AD=Erase count
AF=Bad Cluster Table Count
BB=Uncorrectable Errors
C0=Unsafe Shutdown Count
C2=Temperature
C4=Later Bad Block Count
C5=Current Pending Sector Count
C7=CRC Error Count
DA=CRC Error Count
E7=SSD Life Left
E9=Lifetime Writes to Flash
F0=Write Head
F1=Host Writes
F2=Host Reads
F4=Average Erase Count
F5=Max Erase Count
F6=Total Erase Count

[SmartNVMe] ;Added 6.7.0
01=Critical Warning
02=Composite Temperature
03=Available Spare
04=Available Spare Threshold
05=Percentage Used
06=Data Units Read
07=Data Units Written
08=Host Read Commands
09=Host Write Commands
0A=Controller Busy Time
0B=Power Cycles
0C=Power On Hours
0D=Unsafe Shutdowns
0E=Media and Data Integrity Errors
0F=Number of Error Information Log Entries
